from flask import Flask
import random
import os
app = Flask(__name__)

coin = ['Решка', 'Ребро', 'Орёл']


facts_list = ['Большинство людей, страдающих технологической зависимостью, испытывают сильный стресс, когда они находятся вне зоны покрытия сети или не могут использовать свои устройства.',
             'Согласно исследованию, проведенному в 2018 году, более 50% людей в возрасте от 18 до 34 лет считают себя зависимыми от своих смартфонов.',
            'Изучение технологической зависимости является одной из наиболее актуальных областей научных исследований в настоящее время.',
            'Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы.',
            'Один из способов борьбы с технологической зависимостью - это поиск занятий, которые приносят удовольствие и улучшают настроение.',
            'Илон Маск утверждает, что социальные сети созданы для того, чтобы удерживать нас внутри платформы, чтобы мы тратили как можно больше времени на просмотр контента.']

@app.route("/")
def index():
    return f'''
        <h1>Привет, это сайт с фактами о тех. зависимости. Нажми на текст, чтобы узнать интересный факт</h1>
        <a href="/random_fact">Посмотреть случайный факт!</a>
        <h2>Так же, ты можешь подбросить монетку</h2>
        <a href="/flipcoin">Подбросить монетку</a>
        <h3>А ещё, попытать удачу и получить какое-нибудь изображение</h3>
        <a href="/randomimg">Получи изображение</a>
        <h4>И специально для тебя - Генератор паролей!</h4>
        <a href="/genpass">Сгенерируй пароль из 5 цифр</a>
    '''

@app.route("/random_fact")
def hello_world():
    return f'<p>{random.choice(facts_list)}</p>'

@app.route('/flipcoin')
def flipcoin():
    return f'<p>{random.choice(coin)}</p>'

@app.route('/randomimg')
def randomimg():
    img_name = random.choice(os.listdir('images'))
    return f'<img src="/images/{img_name}" width="500" height="500">'

@app.route('/genpass')
def genpass():
    elements = "+-/*!&$#?=@<>"
    password = ""
    for i in range(7):
        password += random.choice(elements)
    return password    

app.run(debug=True)